Repository: msdx/gradle-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Many projects rely on the Maven Central repository.
zh_cn: 许多项目依赖于Maven 中央仓库。

source: Many settings (like the java version and maximum heap size) can only be specified when launching a new JVM for the build process.
zh_cn: 许多设置（如 java 版本和最大堆大小）可以在启动一个新的 JVM 构建进程时指定。

source: Maven Element
zh_cn: Maven 元素

source: Maven JCenter repository
zh_cn: Maven JCenter 仓库

source: Maven can only deal with one artifact per project.
zh_cn: Maven 只可以处理一个项目一个构件。

source: Maven central repository
zh_cn: Maven 中央仓库

source: Maven local repository
zh_cn: Maven 本地仓库

source: Maven repository
zh_cn: Maven 仓库

source: May also contain Java source files for joint compilation.
zh_cn: 此外可能还包含用于联合编译的 Java 源文件。

source: May also contain Java sources for joint compilation.
zh_cn: 此外可能包含联合编译的 Java 源代码。

source: Meaning
zh_cn: 意义

source: Memory settings for the external process default to the JVM's defaults.
zh_cn: 外部过程默认使用JVM 的的默认内存设置。

source: Metadata rules allow certain parts of a module's metadata to be manipulated from within the build script.
zh_cn: 元数据规则允许模块的元数据在构建脚本中被操纵。

source: Metadata to generate a deployment descriptor file, e.g. application.xml.
zh_cn: 用于生成部署描述符文件的元数据，例如application.xml。

source: Method
zh_cn: 方法

source: Method inheritance might be interesting to use as Gradle's Configuration Injection does not support methods yet (but will in a future release).
zh_cn: 方法继承可能值得使用，尽管 Gradle 的配置注射还未支持方法（但会在以后的版本中支持的）。

source: Model
zh_cn: 模型

source: Modules declared by a module descriptor file (Ivy or POM file) are preferred over modules that have an artifact file only.
zh_cn: 由模块描述符文件（Ivy或 POM 文件）声明的文件优于只有一个artifact 文件的模块。

source: Modules from earlier repositories are preferred over modules in later repositories.
zh_cn: 前面的仓库的模块优于后面的仓库的模块。

source: More about Tasks
zh_cn: 任务详述

source: More information about AntBuilder can be found in 'Groovy in Action' 8.4 or at the Groovy Wiki
zh_cn: 有关AntBuilder的详细信息可以参阅 《Groovy in Action》的8.4章节， 或Groovy 维基。

source: More on plugins
zh_cn: 更多关于插件的内容

source: More specifically, the parallel execution attempts to:
zh_cn: 更具体地说，并行执行尝试︰

source: More types will be added in future Gradle releases.
zh_cn: 在未来的 Gradle 发布中，将会添加更多类型。

source: Most Gradle plugins use enhanced tasks.
zh_cn: 大部分的Gradle插件都使用增强型的任务。

source: Most builds work with files.
zh_cn: 大多数构建工作都要使用到文件。

source: Most of the time you don't need to touch this and you can safely skip this section.
zh_cn: 大多数情况下你不需要去接触它，并且你可以安全地跳过本节。

source: Multi-project Java build
zh_cn: Java 的多项目构建

source: Multi-project builds are always represented by a tree with a single root.
zh_cn: 多项目构建总是由一个具有单个根节点的树表示。

source: Multi-project builds are discussed inChapter 56, Multi-project Builds.
zh_cn: 多项目构建将在第 56 章，多项目生成中进行详述。

source: Multiple developers then spend days on this issue only finally realising that the error would have easy to uncover if they knew that Hibernate had been upgraded from 2.5 to 3.0.5.
zh_cn: 然后多个开发人员花了数天的时间在这个问题上，终于意识到如果他们知道 Hibernate 已经从 2.5 升级到 3.0.5，这个错误会很容易发现。

source: Name
zh_cn: 名称

source: Native Binary Type
zh_cn: 原生二进制文件类型

source: Neither water nor tropicalFish have a task with the name distanceToIceberg.
zh_cn: water和tropicalFish项目都没有一个叫distanceToIceberg的任务。

source: Nested elements are defined in the same way as tasks, by calling a method with the same name as the element we want to define.
zh_cn: 嵌套元素的定义方式与任务相同，通过调用与我们要定义的元素一样的名字的方法。

source: Nevertheless, Groovy projects need to explicitly declare a Groovy dependency.
zh_cn: 然而，Groovy 项目需要显式地声明一个 Groovy 依赖。

source: Next, configure your notification service(s) of choice (see table below for which configuration properties are available):
zh_cn: 接下来，配置你所选择的通知服务（要使用哪一个配置属性可以参见下表）：

source: No code referenced this jar and there was no connection to the project.
zh_cn: 没有代码引用这个 jar 包，这个 jar 包也与该项目没有任何连接。

source: No matter what the language, proper dependency management is important for every project.
zh_cn: 不管用什么语言，对每个项目而言，适当的依赖管理是很重要的。

source: No one could figure out what the jar was for, until it was removed from the build and the application suffered massive performance problem whenever it attempted to authenticate to LDAP.
zh_cn: 没人能弄清楚这个 jar 包是干什么用的，直到它被从构建中移除，然后应用在试图向 LDAP 进行身份验证的时候，遇到了很大的性能问题。

source: No stacktrace options
zh_cn: 没有栈跟踪选项

source: No stacktraces are printed to the console in case of a build error (e.g. a compile error).
zh_cn: 构建错误（如编译错误）时没有栈跟踪打印到控制台。

source: None of these directories need exist or have anything in them.
zh_cn: 这些目录都不需要一定存在，或者是里面有什么内容。

source: None of these directories need to exist or have anything in them; the Scala plugin will simply compile whatever it finds.
zh_cn: 这些目录不一定是存在的，或是里面包含有什么内容；Scala 插件只会进行编译，而不管它发现什么。

source: Normally, Gradle will use the rev attribute for each dependency definition included in an ivy.xml file.
zh_cn: 通常情况下，Gradle 将rev属性用于在ivy.xml文件中包含的每个依赖定义。

source: Not every transitive dependency can be excluded - some transitive dependencies might be essential for correct runtime behavior of the application.
zh_cn: 不是每个传递依赖都可以被排除 — — 一些传递依赖可能是应用程序能正确运行的必要条件。

source: Not null
zh_cn: 非空

source: Note that "B.mustRunAfter(A)" or "B.shouldRunAfter(A)" does not imply any execution dependency between the tasks:
zh_cn: 请注意"B.mustRunAfter(A)"或"B.shouldRunAfter(A)"并不意味着这些任务之间的任何执行上的依赖关系：

source: Note that 'dependency resolve rules' (outlined below) provide a more powerful mechanism for replacing a broken module dependency.
zh_cn: 请注意，“依赖解析规则”（见下文），提供了一种更强大的机制，来取代一个损坏的模块依赖。

source: Note that fsc expects to be restarted whenever the contents of its compile class path change.
zh_cn: 注意，每当 fsc的编译类路径的内容发生变化时，它都需要重新启动。

source: Note that Sonar can only analyze one language per project.
zh_cn: 注意，Sonar 只能分析每个项目的一种语言。

source: Note that Zinc's Nailgun based daemon mode is not supported.
zh_cn: 注意现在 Zinc 基于守护进程模式的Nailgun 还不支持。

source: Note that abstract classes are not executed.
zh_cn: 请注意，抽象类不会被执行。

source: Note that different Gradle versions ship with different Groovy versions; as such, using localGroovy() is less safe then declaring a regular Groovy dependency.
zh_cn: 注意，不同 Gradle 版本附带的 Groovy 版本不同；因此，声明一个固定的 Groovy 依赖要比使用localGroovy()更安全一些。

source: Note that dynamic resolve mode is only available for Gradle's Ivy repositories.
zh_cn: 注意，动态解析模式只对 Gradle 的 Ivy 仓库有效。

source: Note that for most of these properties, the Sonar plugin's object model has an equivalent property, and it isn't necessary to use a withGlobalProperties or withProjectProperties hook.
zh_cn: 注意，对于大多数的这些属性，Sonar 插件的对象模型具有等效的属性，且没有必要使用withGlobalProperties或withProjectProperties的hook。

source: Note that if publishedCode is not set correctly, downstream tasks may not recompile code affected by upstream changes, leading to incorrect compilation results.
zh_cn: 注意，如果publishedCode设置不正确，上游代码发生变化时下游任务可能不会重新编译代码，导致编译结果不正确。

source: Note that if a task has an output directory specified, any files added to that directory since the last time it was executed are ignored and will NOT cause the task to be out of date.
zh_cn: 请注意，如果一个任务有一个指定的输出目录，在它上一次执行之后添加到该目录的所有文件都将被忽略，并且不会使这个任务成为过时状态。

source: Note that this command blocks until the Gradle GUI is closed.
zh_cn: 注意：此命令行窗口被将锁定，直到Gradle GUI被关闭。

source: Note that this completely disables Gradle's default output.
zh_cn: 请注意它完全禁用 Gradle 的默认输出。

source: Note that this is different from a forced version as described above, in that any other versions of this module would not be affected.
zh_cn: 注意，这与上面描述的强制使用一个版本不同，这个模块的其他版本将不受影响。

source: Note, however, that the Zinc compiler requires Java 6 or higher to run.
zh_cn: 但是，要注意的是，Zinc 编译器需要 Java 6 或其以上版本来运行。

source: Note: groupId, artifactId, version, and packaging should always be set directly on the pom object.
zh_cn: 注：groupId，artifactId，version和packaging应该始终直接在pom对象上设置。

source: Note: if you specify a stack trace level on either the Command Line or Favorites tab, it will override this stack trace level.
zh_cn: 注意：如果你在命令行或收藏夹选项卡上指定了堆栈跟踪级别，将会覆盖这里的设置。

source: Note: newly created tasks will show up by default (versus being hidden by default).
zh_cn: 注意：新创建的任务默认情况下是显示状态（而不是隐藏状态）

source: Note: this requires Java 1.6 or higher and requires that you have .gradle files associated in your OS.
zh_cn: 注意：该操作需要 Java 1.6 或更高的版本，并且要求在你的操作系统中关联 gradle 文件。

source: Notes
zh_cn: 备注

source: Notice by the output with the example that the value for compileJava.destinationDir also changed to reflect the configuration change.
zh_cn: 在上面的示例中可以注意到，compileJava.destinationDir的值也被修改了，以反映出配置的修改。

source: Notice that clean does not depend on cleanIdeaWorkspace.
zh_cn: 请注意，clean并不依赖于cleanIdeaWorkspace。

source: Notice that Gradle executes this task a second time, and does not skip the task even though nothing has changed.
zh_cn: 请注意 Gradle 第二次执行执行这项任务时，即使什么都未作改变，也没有跳过该任务。

source: Notice that additional defaults are provided for projects that have the java-base or java plugin applied.
zh_cn: 注意，对于配置使用了 java-base 或 java 插件的project，有提供另外的默认值。

source: Notice that the afterProject notification is received regardless of whether the project evaluates successfully or fails with an exception.
zh_cn: 注意，无论项目评估是成功还是由于异常而失败，都会收到afterProject通知。

source: Notice that the afterTask notification is received regardless of whether the task completes successfully or fails with an exception.
zh_cn: 注意，无论任务成功完成还是异常失败，都会收到afterTask的通知。

source: Notice that we can also mix Groovy code and the Ant task markup.
zh_cn: 请注意我们还可以混合使用 Groovy 代码和 Ant 任务标记。

source: Notification Service
zh_cn: 通知服务

source: Now Gradle will look for your dependencies in the JCenter repository.
zh_cn: 现在 Gradle 将会在 JCenter 仓库中查找你的依赖。

source: Now Gradle will look for your dependencies in this repository.
zh_cn: 现在 Gradle 将会在此仓库中查找你的依赖。

source: Now how does Gradle find it in the repositories?
zh_cn: 现在 Gradle 是如何发现它在存储库中的?

source: Now we rewrite the water build script and boil it down to a single line.
zh_cn: 现在我们改写water的构建脚本，并把它归结成为一行。

source: Now we take the air out of this hack.
zh_cn: 现在我们来看这个技巧。

source: Now we will move our task to a standalone project, so we can publish it and share it with others.
zh_cn: 现在我们将移动我们的任务到一个单独的阿朵很好看，这样我们就可以发布它，并与他人分享。

source: Now you want to deploy this jar file to a remote Maven repository.
zh_cn: 现在你想要将这个 jar 文件部署到远程 Maven 仓库。

source: Now, Gradle knows which files to check to determine whether the task is up-to-date or not.
zh_cn: 现在，Gradle 知道哪些文件要检查以确定任务是否为最新状态。

source: Objective-C language support is provided by means of the 'objective-c' plugin.
zh_cn: 'objective-c' 插件提供了Objective-C 语言的支持。

source: Objective-C sources to be included in a native binary are provided via a ObjectiveCSourceSet, which defines a set of Objective-C source files.
zh_cn: 把Objective-C源码包含到原生二进制文件中，是通过一个 ObjectiveCSourceSet来实现的，它定义了一个Objective-C源文件集。

source: Objective-C++ language support is provided by means of the 'objective-cpp' plugin.
zh_cn: 'objective-cpp' 插件提供了Objective-C++ 语言的支持。

source: Objective-C++ sources to be included in a native binary are provided via a ObjectiveCppSourceSet, which defines a set of Objective-C++ source files.
zh_cn: 把Objective-C++源码包含到原生二进制文件中，是通过一个 ObjectiveCppSourceSet来实现的，它定义了一个Objective-C++源文件集。

source: Obtaining information about your build
zh_cn: 获取构建的相关信息

source: Obviously for a single project build, a project without a build script doesn't make much sense.
zh_cn: 显然对于一个单项目构建，如果一个项目没有构建脚本是没道理的。

source: Obviously the date and hello projects have a configuration dependency on webDist, as all the build logic for the webapp projects is injected by webDist.
zh_cn: 很明显，date 和 hello 都有一个 配置 依赖于 webDist，作为webapp项目的所有构建逻辑都被webDist注入了。

source: Obviously this is a very common use case for Java multi-project builds.
zh_cn: 显示，对于Java 多项目构建当中，这是很常见的情况。

source: Occasionally, you may want to stop the daemons either via the --stop command line option or in a more forceful way.
zh_cn: 有时候，您可能想要通过--stop命令行选项或更有力的方式停止守护程序。

source: Of course one can configure the different file-sets with a closure to define excludes and includes.
zh_cn: 当然，你可以用一个定义了excludes 和 includes 的闭包来配置不同的文件集。

source: Of course this is fully customizable.
zh_cn: 当然，这是可完全自定义的。

source: Of course you can add custom configurations on top of that.
zh_cn: 当然，你可以添加自定义配置到这上面。

source: Of course you can deal with this by adding a mkdir to the beginning of those tasks.
zh_cn: 当然，你可以在这些任务的开始加入mkdir来解决这个问题。

source: Of course, if it is a subproject, only the subproject and its dependent projects are build.
zh_cn: 当然，如果它是一个子项目，那么就只构建子项目和它依赖的项目。

source: Of course, task dependencies across different projects are not limited to tasks with the same name.
zh_cn: 当然，在不同项目之间的任务依赖并不限于具有相同名称的任务。

source: Often an organisation publishes a set of libraries with a single version; where the libraries are built, tested and published together.
zh_cn: 通常一个组织会使用一个版本发布一组库；这些库将在一起构建，测试以及发布。

source: Often this is a "root project" that does nothing more than define common configuration, but as far as Gradle is concerned this root project is still a fully-fledged project, and by using allprojects that project is effectively coupled to all other projects.
zh_cn: 通常这是一个“根项目”，除了定义常见的配置不执行任何操作，但对 Gradle 而言这个根项目仍然是一个成熟的项目，并且通过使用allprojects，该项目有效地与所有其他项目耦合。

source: Often this is the preferred way to customize Eclipse files.
zh_cn: 通常，这是自定义 Eclipse 文件的首选的方法。

source: Often this is the preferred way to customize IDEA files.
zh_cn: 通常，这是自定义 IDEA 文件的首选方法。

source: Often you will want to publish an archive, so that it is usable from another project.
zh_cn: 你经常会想要发布一个归档文件，这样就可从另一个项目中使用它。

source: On a far larger scale, Enterprise projects using Spring, Hibernate, and other libraries, alongside hundreds or thousands of internal projects can have very large dependency trees.
zh_cn: 在更大的规模上，使用 Spring，Hibernate和其他的库，旁边数百或数千个内部项目的企业应用，也有非常大的依赖树。

source: On a large project with many developers changing dependencies, successful builds will be few and far between as the order of dependencies may directly affect whether a build succeeds or fails (or whether a bug appears or disappears in production).
zh_cn: 对于许多开发人员都会更改依赖的大型项目，成功的构建将会少之又少，因为依赖的顺序可能会直接影响到构建是否成功（或者在产品中是否会出现一个 bug）。

source: On most large projects, build migrations and any change to development process is incremental because most organizations can't afford to stop everything and migrate to a build tool's idea of dependency management.
zh_cn: 在大多数的大项目中，构建迁移和对发展过程的任何更改都是增量的，因为大多数组织不能负担得起停止一切事情并迁移到依赖管理的构建工具的想法。

source: On the other hand you need the relevant information for figuring out if things have gone wrong.
zh_cn: 另一方面，如果出了错，你需要找出相关的信息。

source: On the other hand, finalizer tasks are not executed if the finalized task didn't do any work, for example due to failed task dependency or if it's considered up to date.
zh_cn: 另一方面，如果最终的任务什么都不做的话，比如由于失败的任务依赖项或如果它被认为是最新的状态，析构任务不会执行。

source: On the same nesting level the configuration order depends on the alphanumeric position.
zh_cn: 如果是相同的嵌套级别，则配置顺序取决于字母数字的位置。

source: Once a configuration is resolved it is immutable.
zh_cn: 一旦一个配置被解析，那它就是不可变的了。

source: Once each repository has been inspected for the module, Gradle will choose the 'best' one to use.
zh_cn: 一旦已为该模块检查了每个仓库，Gradle 将会选择使用“最好”的一个。

source: Once the properties have been added, they can be read and set like predefined properties.
zh_cn: 一旦属性被添加，他们就可以像预定的属性一样被读取和设置。

source: One can assign also a priority to a particular configuration-to-scope mapping.
zh_cn: 一个configuration可以指定到一个特定的 configuration-to-scope 映射的优先级。

source: One example of a broken module is one that declares a dependency on a library that cannot be found in any of the public repositories, but there are many other reasons why a particular module version is unwanted and a different version is preferred.
zh_cn: 一个坏的模块的例子是，在一个库上声明的一个依赖无法在任何公共仓库中找到，但为什么不能使用一个特定的模块版本，而更希望要另一个版本，还有很多其他原因。

source: One focus of the IDEA plugin is to be open to customization.
zh_cn: IDEA 插件的重点之一是对自定义项较为开放。

source: One of the convention properties added by the plugin is applicationDistribution which is a CopySpec.
zh_cn: applicationDistribution是由插件添加的公约属性之一，它是一个CopySpec。

source: One piece of module metadata that Gradle understands is a module's status scheme.
zh_cn: 其中一个 Gradle 能理解的模块元数据是模块的状态模式。

source: One place to look are the constants in a file from the Ant project.
zh_cn: 其中可以去看的一个地方是 Ant 项目的一个文件中的常量。

source: One reason is that it is offered by other tools and we want to have the check mark in a feature comparison :).
zh_cn: 原因之一是其他工具也有这个功能，而我们想要在功能比较中有这一点。

source: One such type is the simple task, where you define the task with an action closure.
zh_cn: 一种是简单的任务，你可以使用一个action闭包来定义它。

source: One thing is very important to note.
zh_cn: 注意，有一件事情很重要。

source: One use for source sets is to group source files into logical groups which describe their purpose.
zh_cn: 源集的一个用途是，把源文件进行逻辑上的分组，以描述它们的目的。

source: One way to obtain a FileCollection instance is to use the Project.files() method.
zh_cn: 使用Project.files()方法是获取一个FileCollection实例的其中一个方法。

source: One way to obtain a FileTree instance is to use the Project.fileTree() method.
zh_cn: 使用Project.fileTree()方法是获取一个FileTree实例的其中一种方法。

source: Only Show Output When Errors Occur
zh_cn: 只在出现错误时显示输出

source: Only complain if there is no such task!
zh_cn: 如果没有这样的任务，那只能complain。

source: Only if you define a property or a method which has the same name as a member of the Project object, you need to use the project property.
zh_cn: 只有当您定义的属性或方法Project对象的一个成员相同名字时，你才需要使用project属性。

source: Only in case of internal exceptions will stacktraces be printed.
zh_cn: 只有在内部异常的情况下才打印栈跟踪。

source: Only relevant projects are configured which results in faster builds for large multi-projects.
zh_cn: 只适用于相关的项目被配置为在大型多项目中更快地构建。

source: Operating System
zh_cn: 操作系统

source: Option
zh_cn: 选项

source: Optionally, a repository with pattern layout can have its 'organisation' part laid out in Maven style, with forward slashes replacing dots as separators.
zh_cn: 作为可选的功能，一个使用模式布局的仓库可以有它自己的以Maven 风格奠定的“组织”部分，该部分使用斜杠替换点作为分隔符。

source: Or if you do not want to use any repositories at all for storing your dependencies.
zh_cn: 或者是你如果不想使用任何仓库来存储你的依赖。

source: Or some combination of the two.
zh_cn: 或者是上面两者都有。

source: Or you can only provide client modules for POMs with bad metadata.
zh_cn: 或者，你可以只为元数字不正确的 POMs 提供客户端模块。

source: Or, you can add behaviour to an Ant target:
zh_cn: 或者，您可以将行为添加到 Ant 目标中：

source: Ordering tasks
zh_cn: 任务排序

source: Originally Gradle has used the '/' character as a natural path separator.
zh_cn: 原来 Gradle 使用/字符作为自然路径分隔符。

source: Other build systems require a wholesale replacement of this approach before migrating.
zh_cn: 其他的构建系统在迁移之前需要对这种方法进行大量的替换。

source: Other build systems use inheritance as the primary means for defining common behavior.
zh_cn: 其他构建系统使用继承作为主要手段，用于定义共同的行为。

source: Other examples of the dependency exclusions can be found in the reference for ModuleDependency or DependencyHandler.
zh_cn: 其他相关依赖关系排除的示例，可以参考 ModuleDependency或DependencyHandler。

source: Other plugins add the ability to include Groovy and Scala source files in a source set.
zh_cn: 其他有一些插件添加了在源集里包含 Groovy 和 Scala 的源代码文件的能力。

source: Other plugins, such as the Groovy plugin, exclude additional types of files from this collection.
zh_cn: 其他插件，如Groovy 插件，会从该集合中排除其他类型的文件。

source: Otherwise Gradle throws an exception, saying that a task with such a name already exists.
zh_cn: 否则 Gradle 将抛出异常，说这种名称的任务已经存在。

source: Otherwise a multiproject build is executed.
zh_cn: 否则执行多项目构建。

source: Otherwise applying eclipse plugin is enough.
zh_cn: 否则应用eclipse插件就足够了。

source: Otherwise snapshots are deployed to the snapshotRepository element.
zh_cn: 否则，snapshots将部署到snapshotRepository元素中。

source: Otherwise the script gets compiled and the new version is stored in the cache.
zh_cn: 否则该脚本会重新编译，并把最新版本存在缓存中。

source: Otherwise, a File instance is constructed by prepending the project directory path to the supplied path.
zh_cn: 否则，会通过先计算所提供的路径相对于项目目录的相对路径来构造File实例。

source: Otherwise, execution of the task will fail with a message saying that groovyClasspath could not be inferred.
zh_cn: 其他情况，该task 将执行失败，并提示无法推断 groovyClasspath。

source: Otherwise, execution of the task will fail with a message saying that scalaClasspath could not be inferred.
zh_cn: 其他情况，该task 将执行失败，并提示无法推断 scalaClasspath。

source: Otherwise, the project at hand may be referenced with the wrong artifact ID from generated POMs for other projects in the same build.
zh_cn: 否则，在相同的构建中，这个项目可能会被其他项目所生成的POMs 中错误的 artifact ID所引用到。

source: Our example task was defined using an action closure.
zh_cn: 我们的示例任务被用一个操作（action）闭包来定义。

source: Our final message for this chapter is that multi-project builds with Gradle are usually not difficult.
zh_cn: 我们对这一章最后要说的是，使用 Gradle 的多项目构建通常不会很难。

source: Our first examples are about marine life.
zh_cn: 我们的第一个例子是关于海洋生活的。

source: Output of gradle -I init.gradle build
zh_cn: gradle -I init.gradle build 的输出结果

source: Output of gradle -a :api:build
zh_cn: gradle :api:build的输出结果

source: Output of gradle -q -PcommandLineProjectProp=commandLineProjectPropValue -Dorg.gradle.project.systemProjectProp=systemPropertyValue printProps
zh_cn: gradle -q -PcommandLineProjectProp=commandLineProjectPropValue -Dorg.gradle.project.systemProjectProp=systemPropertyValue printProps的输出结果

source: Output of gradle -q :hello :krill:hello hello
zh_cn: gradle -q :hello :krill:hello hello的输出结果

source: Output of gradle -q a
zh_cn: gradle -q a的输出结果

source: Output of gradle -q action
zh_cn: gradle -q action的输出结果

source: Output of gradle -q allFiles
zh_cn: gradle -q allFiles的输出结果

source: Output of gradle -q broken
zh_cn: gradle -q broken的输出结果

source: Output of gradle -q check
zh_cn: gradle -q check的输出结果

source: Output of gradle -q compile
zh_cn: gradle -q compile的输出结果

source: Output of gradle -q configure
zh_cn: gradle -q configure的输出结果

source: Output of gradle -q consume
zh_cn: gradle -q consume的输出结果

source: Output of gradle -q copy
zh_cn: gradle -q copy 的输出结果

source: Output of gradle -q copyVsFiles
zh_cn: gradle -q copyVsFiles的输出结果

source: Output of gradle -q dependencies
zh_cn: gradle -q dependencies的输出结果

source: Output of gradle -q distanceToIceberg
zh_cn: gradle -q distanceToIceberg的输出结果

source: Output of gradle -q files
zh_cn: gradle -q files的输出结果

source: Output of gradle -q groupPing
zh_cn: Gradle q groupPing的输出结果

source: Output of gradle -q hello greeting
zh_cn: gradle -q hello greeting的输出结果

source: Output of gradle -q hello
zh_cn: gradle -q hello的输出结果

source: Output of gradle -q list
zh_cn: gradle -q list的输出结果

source: Output of gradle -q listBirds
zh_cn: gradle -q listBirds的输出结果

source: Output of gradle -q listFish
zh_cn: gradle -q listFish的输出结果

source: Output of gradle -q listJars
zh_cn: gradle -q listJars的输出结果

source: Output of gradle -q myTask
zh_cn: gradle -q myTask 的输出结果

source: Output of gradle -q myZip
zh_cn: gradle -q myZip 的输出结果

source: Output of gradle -q pingServer1
zh_cn: Gradle q pingServer1的输出结果

source: Output of gradle -q printProperties
zh_cn: gradle -q printProperties的输出结果

source: Output of gradle -q show
zh_cn: gradle -q show 的输出结果

source: Output of gradle -q taskX
zh_cn: gradle -q taskX的输出结果

source: Output of gradle -q taskY taskX
zh_cn: gradle -q taskY taskX 的输出结果

source: Output of gradle -q taskY
zh_cn: gradle -q taskY 的输出结果

source: Output of gradle -q test
zh_cn: gradle -q test的输出结果

source: Output of gradle :api:build
zh_cn: gradle :api:build的输出结果

source: Output of gradle :api:buildDependents
zh_cn: gradle :api:buildDependents的输出结果

source: Output of gradle :api:buildNeeded
zh_cn: gradle: api:buildNeeded 的输出结果

source: Output of gradle disableMe
zh_cn: Gradle disableMe的输出结果

source: Output of gradle distZip
zh_cn: gradle distZip的输出

source: Output of gradle distanceToIceberg
zh_cn: gradle distanceToIceberg的输出结果

source: Output of gradle hello -PskipHello
zh_cn: gradle hello -PskipHello的输出结果
